app/Views/auth/login.php

SELECT COUNT(*) AS `numrows` FROM `users`
---
                <?php
                // Show register link only if no users exist
                $userModel = new \App\Models\UserModel();
                if ($userModel->countAll() == 0):