app/Models/UserModel.php

    public function findUserByEmail($where)
	{
        try {
            $builder = $this->db->table($this->table);
            $query = $builder->select('*')
                ->where('email', $where['email'])
                ->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@example.com'